PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/dshot/dshot.c
				/* Trigger on FXIO pin transition, Baud mode */
				flexio_putreg32(FLEXIO_TIMCTL_TRGSEL(2 * timer_io_channels[channel].dshot.flexio_pin) |
						FLEXIO_TIMCTL_TRGPOL(FLEXIO_TIMER_TRIGGER_POLARITY_ACTIVE_HIGH) |
						FLEXIO_TIMCTL_TRGSRC(FLEXIO_TIMER_TRIGGER_SOURCE_INTERNAL) |
						FLEXIO_TIMCTL_PINCFG(FLEXIO_PIN_CONFIG_OUTPUT_DISABLED) |
						FLEXIO_TIMCTL_PINSEL(0) |
						FLEXIO_TIMCTL_PINPOL(FLEXIO_PIN_ACTIVE_LOW) |
						FLEXIO_TIMCTL_TIMOD(FLEXIO_TIMER_MODE_DUAL8_BIT_BAUD_BIT),
						IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);

				/* Enable shifter interrupt for receiving data */
				enable_shifter_status_interrupts(1 << channel);
			}
		}
	}

	return OK;
}

static bool decode_gcr_payload(uint32_t value, uint16_t *payload)
{
	uint32_t data;
	uint32_t csum_data;

	if ((value & 0x1) == 0) {
		return false;
	}

	value = value ^ (value >> 1);

	data = gcr_decode[value & 0x1fU];
	data |= gcr_decode[(value >> 5U) & 0x1fU] << 4U;
	data |= gcr_decode[(value >> 10U) & 0x1fU] << 8U;
	data |= gcr_decode[(value >> 15U) & 0x1fU] << 12U;

	csum_data = data;
	csum_data = csum_data ^ (csum_data >> 8U);
	csum_data = csum_data ^ (csum_data >> NIBBLES_SIZE);

	if ((csum_data & 0xFU) != 0xFU) {
		return false;
	}

	*payload = (data >> 4) & 0xFFF;
	return true;
}

static void decode_dshot_telemetry(uint32_t payload, struct BDShotTelemetry *packet)
{
	// MSB of the 9-bit mantissa clear means extended telemetry, not eRPM
	uint32_t mantissa = payload & 0x01FF;
	bool is_telemetry = !(mantissa & 0x0100);

	if (_edt_enabled && is_telemetry) {
		packet->type = (payload & 0x0F00) >> 8;
		packet->value = payload & 0x00FF;

	} else {
		uint8_t exponent = ((payload >> 9) & 0x7);
		uint16_t period = (payload & 0x1FF);
		period = period << exponent;

		packet->type = DSHOT_EDT_ERPM;

		if (period == 65408 || period == 0) {
			packet->value = 0;

		} else {
			packet->value = (1000000U * 60U / 100U + period / 2U) / period;
		}
	}
}

static void bdshot_note_success(volatile dshot_channel_t *ch)
{
	ch->consecutive_failures = 0;

	if (ch->consecutive_successes < BDSHOT_OFFLINE_COUNT) {
		ch->consecutive_successes++;
	}

	if (ch->consecutive_successes >= BDSHOT_OFFLINE_COUNT) {
		ch->online = true;
	}
}

static void bdshot_restart_training(volatile dshot_channel_t *ch, uint32_t channel)
{
	ch->bdshot_training_done = false;
	ch->bdshot_training_mask = 0;
	ch->bdshot_training_count = 0;
	ch->bdshot_training_success = 0;
	ch->bdshot_tcmp_offset = BDSHOT_TCMP_MIN_OFFSET;
	ch->consecutive_successes = 0;
	ch->consecutive_failures = 0;
	ch->online = false;
	flexio_dshot_set_tcmp(channel);
}

static void bdshot_note_failure(volatile dshot_channel_t *ch, uint32_t channel)
{
	if (!ch->bdshot_training_done) {
		return;
	}

	ch->consecutive_successes = 0;

	if (ch->consecutive_failures < BDSHOT_RETRAIN_COUNT) {
		ch->consecutive_failures++;
	}

	// Transient CRC noise recovers on the frozen TCMP. A wrong baud (ESC reset, drift)
	// will not, so restart the offset sweep after a second offline period.
	if (ch->consecutive_failures >= BDSHOT_OFFLINE_COUNT) {
		ch->online = false;
	}

	if (ch->consecutive_failures >= BDSHOT_RETRAIN_COUNT) {
		bdshot_restart_training(ch, channel);
	}
}

static void bdshot_train(volatile dshot_channel_t *ch, uint32_t channel, uint32_t value)
{
	uint16_t payload;

	if (decode_gcr_payload(value, &payload)) {
		ch->bdshot_training_success++;

	} else if ((value & 0x1) == 0) {
		ch->bdshot_training_count = BDSHOT_TRAINING_TRIES - 1;
	}

	ch->bdshot_training_count++;

	if (ch->bdshot_training_count == BDSHOT_TRAINING_TRIES) {
		if (ch->bdshot_training_success >= BDSHOT_TRAINING_SUCCESS) {
			ch->bdshot_training_mask |=
				(1u << BDSHOT_TCMP_TO_MASK(ch->bdshot_tcmp_offset));
		}

		ch->bdshot_training_count = 0;
		ch->bdshot_training_success = 0;
		ch->bdshot_tcmp_offset++;

		if (ch->bdshot_tcmp_offset > BDSHOT_TCMP_MAX_OFFSET) {

			if (ch->bdshot_training_mask == 0) {
				ch->bdshot_tcmp_offset = BDSHOT_TCMP_MIN_OFFSET;

			} else {
				int low  = __builtin_ctz(ch->bdshot_training_mask);
				int high = 31 - __builtin_clz(ch->bdshot_training_mask);
				ch->bdshot_tcmp_offset = ((low + high) / 2) + BDSHOT_TCMP_MIN_OFFSET;
				ch->bdshot_training_done = true;
				ch->consecutive_failures = 0;
				ch->consecutive_successes = BDSHOT_OFFLINE_COUNT;
				ch->online = true;
			}
		}

		flexio_dshot_set_tcmp(channel);
	}
}

static void bdshot_process_responses(uint32_t recv_mask, const uint32_t *raw, uint32_t rx_busy)
{
	for (uint8_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		volatile dshot_channel_t *ch = &dshot_inst[channel];

		if (!ch->init || !ch->bdshot) {
			continue;
		}

		// DShot.cpp waits until every BDShot bit is set; a miss or CRC fail must not stall the others
		bdshot_ready_mask |= (1u << channel);

		if ((recv_mask & (1 << channel)) == 0) {
			if (rx_busy & (1u << channel)) {
				continue;
			}

			ch->no_response_cnt++;
			bdshot_note_failure(ch, channel);
			continue;
		}

		uint32_t value = ~raw[channel] & 0xFFFFF;

		if (!ch->bdshot_training_done) {
			bdshot_train(ch, channel, value);
			continue;
		}

		uint16_t payload = 0;

		if (!decode_gcr_payload(value, &payload)) {
			if ((value & 0x1) == 0) {
				ch->frame_error_cnt++;

			} else {
				ch->crc_error_cnt++;
			}

			bdshot_note_failure(ch, channel);
			continue;
		}

		struct BDShotTelemetry packet = {};

		decode_dshot_telemetry(payload, &packet);

		switch (packet.type) {
		case DSHOT_EDT_ERPM:
			ch->erpm = packet.value;
			ch->erpm_valid = true;
			break;

		case DSHOT_EDT_TEMPERATURE:
			ch->edt_temp.value = packet.value;
			ch->edt_temp.ready = true;
			break;

		case DSHOT_EDT_VOLTAGE:
			ch->edt_volt.value = packet.value;
			ch->edt_volt.ready = true;
			break;

		case DSHOT_EDT_CURRENT:
			ch->edt_curr.value = packet.value;
			ch->edt_curr.ready = true;
			break;

		default:
			break;
		}

		bdshot_note_success(ch);
	}
}

int up_dshot_init(uint32_t channel_mask, uint32_t bdshot_channel_mask, unsigned dshot_pwm_freq, bool edt_enable)
{
	irqstate_t irqflags = px4_enter_critical_section();
	_edt_enabled = edt_enable;
	_dshot_armed = false;
	bdshot_ready_mask = 0;
	bdshot_recv_mask = 0;
	dshot_mask = 0;
	memset((void *)dshot_inst, 0, sizeof(dshot_inst));
	px4_leave_critical_section(irqflags);

	/* Calculate dshot timings based on dshot_pwm_freq */
	dshot_tcmp = 0x2F00 | (((BOARD_FLEXIO_PREQ / (dshot_pwm_freq * 3) / 2) - 1) & 0xFF);
	dshot_speed = dshot_pwm_freq;

	// ESC turnaround + 21-bit GCR at 5/4 dshot rate + margin. Skip the next TX while this is open.
	unsigned freq = dshot_pwm_freq != 0 ? dshot_pwm_freq : 1;
	_bdshot_rx_timeout = 30 + (21ull * 1000000ull * 4ull) / (5ull * freq) + 50;

	/* Clock FlexIO peripheral */
	imxrt_clockall_flexio1();

