PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/dshot/dshot.c
	/* Reset FlexIO peripheral */
	flexio_modifyreg32(IMXRT_FLEXIO_CTRL_OFFSET, 0,
			   FLEXIO_CTRL_SWRST_MASK);
	flexio_putreg32(0, IMXRT_FLEXIO_CTRL_OFFSET);

	/* Initialize FlexIO peripheral */
	flexio_modifyreg32(IMXRT_FLEXIO_CTRL_OFFSET,
			   (FLEXIO_CTRL_DOZEN_MASK |
			    FLEXIO_CTRL_DBGE_MASK |
			    FLEXIO_CTRL_FASTACC_MASK |
			    FLEXIO_CTRL_FLEXEN_MASK),
			   (FLEXIO_CTRL_DBGE(1) |
			    FLEXIO_CTRL_FASTACC(1) |
			    FLEXIO_CTRL_FLEXEN(0)));

	/* FlexIO IRQ handling */
	up_enable_irq(IMXRT_IRQ_FLEXIO1);
	irq_attach(IMXRT_IRQ_FLEXIO1, flexio_irq_handler, 0);

	dshot_mask = 0x0;

	for (unsigned channel = 0; (channel_mask != 0) && (channel < DSHOT_TIMERS); channel++) {
		if (channel_mask & (1 << channel)) {

			if (timer_io_channels[channel].dshot.pinmux == 0) { // board does not configure dshot on this pin
				continue;
			}

			imxrt_config_gpio(timer_io_channels[channel].dshot.pinmux | IOMUX_PULL_UP);

			if (bdshot_channel_mask & (1 << channel)) {
				dshot_inst[channel].bdshot = true;
				dshot_inst[channel].bdshot_training_mask = 0;
				dshot_inst[channel].bdshot_tcmp_offset = BDSHOT_TCMP_MIN_OFFSET;
				dshot_inst[channel].bdshot_training_done = false;
				flexio_dshot_set_tcmp(channel);

			} else {
				dshot_inst[channel].bdshot = false;
			}

			flexio_dshot_output(channel, timer_io_channels[channel].dshot.flexio_pin, dshot_tcmp, dshot_inst[channel].bdshot);

			dshot_inst[channel].init = true;

			dshot_mask |= (1 << channel);
		}
	}

	// Channels requested for BDShot but not capturable must not block DShot.cpp's all-ready wait
	for (unsigned channel = 0; channel < MAX_TIMER_IO_CHANNELS; channel++) {
		if ((bdshot_channel_mask & (1u << channel)) == 0) {
			continue;
		}

		if (channel >= DSHOT_TIMERS || !dshot_inst[channel].bdshot) {
			bdshot_ready_mask |= (1u << channel);
		}
	}

	flexio_modifyreg32(IMXRT_FLEXIO_CTRL_OFFSET, 0,
			   FLEXIO_CTRL_FLEXEN_MASK);

	return dshot_mask;
}

uint16_t up_bdshot_get_ready_mask(void)
{
	return (uint16_t)bdshot_ready_mask;
}

int up_bdshot_num_errors(uint8_t channel)
{
	if (channel >= DSHOT_TIMERS) {
		return 0;
	}

	return dshot_inst[channel].crc_error_cnt + dshot_inst[channel].frame_error_cnt + dshot_inst[channel].no_response_cnt;
}

int up_bdshot_get_erpm(uint8_t channel, int *erpm)
{
	// Channels without capture keep their permanent ready bit, so return before clearing it
	if (channel >= DSHOT_TIMERS || !dshot_inst[channel].bdshot) {
		return -1;
	}

	int status = -1;

	if (dshot_inst[channel].erpm_valid) {
		*erpm = (int)dshot_inst[channel].erpm;
		status = 0;
	}

	bdshot_ready_mask &= ~(1u << channel);
	return status;
}

int up_bdshot_get_extended_telemetry(uint8_t channel, int type, uint8_t *value)
{
	if (channel >= DSHOT_TIMERS) {
		return -1;
	}

	volatile edt_sample_t *sample = NULL;

	switch (type) {
	case DSHOT_EDT_TEMPERATURE:
		sample = &dshot_inst[channel].edt_temp;
		break;

	case DSHOT_EDT_VOLTAGE:
		sample = &dshot_inst[channel].edt_volt;
		break;

	case DSHOT_EDT_CURRENT:
		sample = &dshot_inst[channel].edt_curr;
		break;

	default:
		return -1;
	}

	if (!sample->ready) {
		return -1;
	}

	*value = sample->value;
	sample->ready = false;
	return 0;
}

int up_bdshot_channel_capture_supported(uint8_t channel)
{
	if (channel >= DSHOT_TIMERS) {
		return 0;
	}

	return dshot_inst[channel].init && dshot_inst[channel].bdshot;
}

int up_bdshot_channel_online(uint8_t channel)
{
	if (channel >= DSHOT_TIMERS) {
		return 0;
	}

	return dshot_inst[channel].online;
}

void up_bdshot_status(void)
{
	for (uint8_t channel = 0; (channel < DSHOT_TIMERS); channel++) {

		if (dshot_inst[channel].init) {
			PX4_INFO("Channel %i %s Last erpm %i value", channel, up_bdshot_channel_online(channel) ? "online" : "offline",
				 dshot_inst[channel].erpm);

			if (_edt_enabled) {
				PX4_INFO("EDT Temp %u C  Volt %.2f V  Curr %u A",
					 dshot_inst[channel].edt_temp.value,
					 (double)dshot_inst[channel].edt_volt.value * 0.25,
					 dshot_inst[channel].edt_curr.value);
			}

			PX4_INFO("BDSHOT Training done: %s TCMP offset: %d", dshot_inst[channel].bdshot_training_done ? "YES" : "NO",
				 dshot_inst[channel].bdshot_tcmp_offset);
			PX4_INFO("CRC errors Frame error No response");
			PX4_INFO("%10lu %11lu %11lu", dshot_inst[channel].crc_error_cnt, dshot_inst[channel].frame_error_cnt,
				 dshot_inst[channel].no_response_cnt);
		}
	}
}

void up_dshot_trigger(void)
{
	if (!_dshot_armed) {
		return;
	}

	uint32_t recv_mask;
	uint32_t rx_busy = 0;
	uint32_t tx_mask = 0;
	uint32_t raw[DSHOT_TIMERS];

	irqstate_t irqflags = px4_enter_critical_section();
	hrt_abstime now = hrt_absolute_time();

	for (uint8_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		bdshot_harvest_channel(channel);
	}

	recv_mask = bdshot_recv_mask;
	bdshot_recv_mask = 0;

	for (uint8_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		raw[channel] = dshot_inst[channel].raw_response;

		if (dshot_inst[channel].bdshot && dshot_inst[channel].state == BDSHOT_RECEIVE
		    && (now - dshot_inst[channel].rx_started) < _bdshot_rx_timeout) {
			rx_busy |= (1u << channel);
		}
	}

	// Reconfigure TX before releasing the IRQ so a just-arriving frame cannot land on DSHOT_START
	for (uint8_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		if (!dshot_inst[channel].init || dshot_inst[channel].data_seg1 == 0) {
			continue;
		}

		if (rx_busy & (1u << channel)) {
			continue;
		}

		if (dshot_inst[channel].bdshot) {
			flexio_dshot_prepare_tx(channel);

		} else {
			dshot_inst[channel].state = DSHOT_START;
		}

		tx_mask |= (1u << channel);
	}

	px4_leave_critical_section(irqflags);

	bdshot_process_responses(recv_mask, raw, rx_busy);

	for (uint8_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		if (tx_mask & (1u << channel)) {
			flexio_putreg32(dshot_inst[channel].data_seg1, IMXRT_FLEXIO_SHIFTBUF0_OFFSET + channel * 0x4);
		}
	}

	clear_timer_status_flags(tx_mask);
	enable_shifter_status_interrupts(tx_mask);
	enable_timer_status_interrupts(tx_mask);
}

static uint64_t dshot_expand_data(uint16_t packet)
{
	unsigned int mask;
	unsigned int index = 0;
	uint64_t expanded = 0x0;

	for (mask = 0x8000; mask != 0; mask >>= 1) {
		if (packet & mask) {
			expanded = expanded | ((uint64_t)0x3 << index);

		} else {
			expanded = expanded | ((uint64_t)0x1 << index);
		}

		index = index + 3;
	}

	return expanded;
}

/**
* bits 	1-11	- throttle value (0-47 are reserved, 48-2047 give 2000 steps of throttle resolution)
* bit 	12		- dshot telemetry enable/disable
* bits 	13-16	- XOR checksum
**/
void dshot_motor_data_set(uint8_t channel, uint16_t throttle, bool telemetry)
{
	if (channel < DSHOT_TIMERS && dshot_inst[channel].init) {
		uint16_t csum_data;
		uint16_t packet = 0;
		uint16_t checksum = 0;

		packet |= throttle << DSHOT_THROTTLE_POSITION;
		packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

		if (dshot_inst[channel].bdshot) {
			csum_data = ~packet;

		} else {
			csum_data = packet;
		}

		/* XOR checksum calculation */
		csum_data >>= NIBBLES_SIZE;

		for (unsigned i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
			checksum ^= (csum_data & 0x0F); // XOR data by nibbles
			csum_data >>= NIBBLES_SIZE;
		}

		packet |= (checksum & 0x0F);

		uint64_t dshot_expanded = dshot_expand_data(packet);

		dshot_inst[channel].data_seg1 = (uint32_t)(dshot_expanded & 0xFFFFFF);
		dshot_inst[channel].irq_data = (uint32_t)(dshot_expanded >> 24);

		if (!dshot_inst[channel].bdshot) {
			dshot_inst[channel].state = DSHOT_START;
		}
	}
}

int up_dshot_arm(bool armed)
{
	irqstate_t irqflags = px4_enter_critical_section();
	_dshot_armed = armed;

	for (uint8_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		if (!dshot_inst[channel].init) {
			continue;
		}

		if (armed) {
			flexio_dshot_prepare_tx(channel);

		} else {
			flexio_dshot_stop_channel(channel);
		}
	}

	if (armed) {
		bdshot_recv_mask = 0;
		clear_shifter_status_flags(dshot_mask);
		clear_timer_status_flags(dshot_mask);
		enable_shifter_status_interrupts(dshot_mask);
		enable_timer_status_interrupts(dshot_mask);

	} else {
		disable_shifter_status_interrupts(dshot_mask);
		disable_timer_status_interrupts(dshot_mask);
	}

	px4_leave_critical_section(irqflags);
	return 0;
}
